[
    {
        "id": "01",
        "title": "7AM ARIVU",
        "description": "7AM ARIVU is a 2011 Indian Tamil-language science fiction martial-arts film written and directed by A. R. Murugadoss, featuring Suriya, Johnny Tri Nguyen and Shruti Haasan. In the film, a medical student enlists the help of a circus artist, who is a descendant of Bodhidharma, to revive the legend's skills and knowledge, while a Chinese man with hypnotic powers starts a government-planned biological war against India",
        "ratings": 4,
        "favorite": true,
        "dislike": false,
        "url": "https://www.tamilpaa.com/upload/movies/7aam-arivu.jpg",
        "trailerUrl": "https://youtu.be/ikbXIYXG1ow"
    },
    {
        "id": "02",
        "title": "Iron Man - 3",
        "description": "Iron Man - 3 is a 2013 American superhero film based on the Marvel Comics character Iron Man, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures.[N 1] It is the sequel to Iron Man (2008) and Iron Man 2 (2010), and the seventh film in the Marvel Cinematic Universe (MCU). The film was directed by Shane Black from a screenplay he co-wrote with Drew Pearce, and stars Robert Downey Jr. as Tony Stark / Iron Man alongside Gwyneth Paltrow, Don Cheadle, Guy Pearce, Rebecca Hall, Stéphanie Szostak, James Badge Dale, Jon Favreau, and Ben Kingsley. In Iron Man 3, Tony Stark wrestles with the ramifications of the events of The Avengers during a national terrorism campaign on the United States led by the mysterious Mandarin.",
        "ratings": 3,
        "favorite": false,
        "dislike": false,
        "url": "https://terrigen-cdn-dev.marvel.com/content/prod/1x/ironman3_lob_crd_01_10.jpg",
        "trailerUrl": "https://youtu.be/Ke1Y3P9D0Bc"
    },
    {
        "id": "03",
        "title": "RRR",
        "description": "RRR is a 2022 Indian Telugu-language epic action drama film directed by S. S. Rajamouli, who wrote the film with V. Vijayendra Prasad. It was produced by D. V. V. Danayya of DVV Entertainment. The film stars N. T. Rama Rao Jr., Ram Charan, Ajay Devgn, Alia Bhatt, Shriya Saran, Samuthirakani, Ray Stevenson, Alison Doody, and Olivia Morris. It centers on two real-life Indian revolutionaries, Alluri Sitarama Raju (Charan) and Komaram Bheem (Rama Rao), and their fight against the British Raj. Set in 1920, the plot explores the undocumented period in their lives when both the revolutionaries chose to go into obscurity before they began the fight for their country.",
        "ratings": 4,
        "favorite": false,
        "dislike": false,
        "url": "https://www.thehindu.com/incoming/5wb02w/article65261853.ece/alternates/FREE_1200/RRR_Still-2-new.jpg",
        "trailerUrl": "https://youtu.be/NgBoMJy386M"
    },
    {
        "id": "04",
        "title": "Soorarai Potru",
        "description": "Soorarai Pottru is a 2020 Indian Tamil-language drama film written and directed by Sudha Kongara and produced by Suriya, Jyothika and Guneet Monga. Kongara co-wrote the screenplay alongside Shalini Usha Nair, with Aalif Surti and Ganeshaa providing additional screenplay, and Vijay Kumar and P. Virumandi, writing the dialogues. The film stars Suriya, Aparna Balamurali and Paresh Rawal while Mohan Babu, Urvashi and Karunas feature in other important supporting roles.",
        "ratings": 5,
        "favorite": false,
        "dislike": false,
        "url": "https://moviegalleri.net/wp-content/gallery/soorarai-pottru-hd-images/Soorarai-Pottru-Movie-HD-Images-Suriya-Aparna-Balamurali-0a959d0.jpg",
        "trailerUrl": "https://youtu.be/fa_DIwRsa9o"
    },
    {
        "id": "05",
        "title": "Vikram",
        "description": "Vikram is a 2022 Indian Tamil-language action thriller film written and directed by Lokesh Kanagaraj and produced by Raaj Kamal Films International.[8] The film stars Kamal Haasan, Vijay Sethupathi and Fahadh Faasil.[9][10] Kalidas Jayaram,[11] Narain and Chemban Vinod Jose play supporting roles while Suriya makes a cameo appearance as Rolex. The film's soundtrack and score are composed by Anirudh Ravichander, with cinematography handled by Girish Gangadharan and editing done by Philomin Raj. The film serves as the second installment in the Lokesh Cinematic Universe (LCU).[12] The plot follows a black-ops squad led by Agent Vikram, in which he aims to bring down a drug syndicate group called Vetti Vagaiyara, led by Sandhanam, who wants the missing drugs to be delivered to his boss Rolex.",
        "ratings": 5,
        "favorite": false,
        "dislike": false,
        "url": "https://i0.wp.com/insidegistblog.com/wp-content/uploads/2022/07/Screenshot_20220708-175550_Opera-Mini.jpg?fit=616%2C910&ssl=1",
        "trailerUrl": "https://youtu.be/OKBMCL-frPU"
    },
    {
        "id": "06",
        "title": "THOR",
        "description": "THOR is a 2011 American superhero film based on the Marvel Comics character of the same name. Produced by Marvel Studios and distributed by Paramount Pictures,[N 1] it is the fourth film in the Marvel Cinematic Universe (MCU). It was directed by Kenneth Branagh, written by the writing team of Ashley Edward Miller and Zack Stentz along with Don Payne, and stars Chris Hemsworth as the title character alongside Natalie Portman, Tom Hiddleston, Stellan Skarsgård, Colm Feore, Ray Stevenson, Idris Elba, Kat Dennings, Rene Russo, and Anthony Hopkins. After reigniting a dormant war, Thor is banished from Asgard to Earth, stripped of his powers and his hammer Mjölnir. As his brother Loki (Hiddleston) plots to take the Asgardian throne, Thor must prove himself worthy.KWJDKJF",
        "ratings": 5,
        "favorite": false,
        "dislike": false,
        "url": "https://lumiere-a.akamaihd.net/v1/images/p_thorloveandthunder_22808_89cd85bd.jpeg",
        "trailerUrl": "https://youtu.be/vJUDu40Z_RY"
    }
]